In [2]:
print("Hello World!")

Hello World!

In [3]:
import pandas as pd

In [4]:
pd.DataFrame({'Yes':[50, 21], 'No':[131, 2]})

   Yes   No
0   50  131
1   21    2

In [5]:
 pd.DataFrame({'Bob':['Hello', 'World'], 'Sue': ['Hello', 'Man']}, index=['1', '2'])

     Bob    Sue
1  Hello  Hello
2  World    Man

In [6]:
pd.Series([1,2,3,4,5,6,7,8])

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [7]:
pd.Series([12, 34, 45], index = ['Math', 'Science', 'Health'], name = 'Subjects')

Math       12
Science    34
Health     45
Name: Subjects, dtype: int64

In [ ]:
# question from leetcode
To determine whether a country is considered `big`, there are two conditions to verify, as stated in the description:
The country must have an area of at least three million square kilometers, denoted as area >= 3,000,000.

The population of the country should be a minimum of twenty-five million, expressed as population >= 25,000,000.

In [2]:
import pandas as pd

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    df = world[(world['area'] >= 3000000) | (world['population'] >= 25000000)]
    return df[['name', 'population', 'area']]

# Applying functions into pandas

In [3]:
import pandas as pd
data = {'Name' : ['Ram', 'Shyam'],
        'Age' : [12, 23],
        'Salary' : [1200, 3400]}

df = pd.DataFrame(data)
df

    Name  Age  Salary
0    Ram   12    1200
1  Shyam   23    3400

In [6]:
def double_salary(salary):
    return salary * 2

df['double salary'] = df['Salary'].apply(double_salary)
df

    Name  Age  Salary  double salary
0    Ram   12    1200           2400
1  Shyam   23    3400           6800

In [8]:
def total_compensation(row):
    return row['Age'] * 1000 + row['Salary']

df['Total Compensation'] = df.apply(total_compensation, axis = 1)
df

    Name  Age  Salary  double salary  Total Compensation
0    Ram   12    1200           2400               13200
1  Shyam   23    3400           6800               26400